avrdudes/avr-libc/include/avr/ioavr32dd32.h
/* Resolution selection bit group configurations*/
typedef enum ADC_RESSEL_enum
{
    ADC_RESSEL_12BIT_gc            = (ADC_RESSEL_12BIT_gv << ADC_RESSEL_gp),  /* 12-bit mode */
    ADC_RESSEL_10BIT_gc            = (ADC_RESSEL_10BIT_gv << ADC_RESSEL_gp)   /* 10-bit mode */
} ADC_RESSEL_t;

/* Sampling Delay Selection bit group values */
typedef enum ADC_SAMPDLY_VALUES_enum
{
    ADC_SAMPDLY_DLY0_gv            = 0x00,  /* Delay 0 CLK_ADC cycles */
    ADC_SAMPDLY_DLY1_gv            = 0x01,  /* Delay 1 CLK_ADC cycles */
    ADC_SAMPDLY_DLY2_gv            = 0x02,  /* Delay 2 CLK_ADC cycles */
    ADC_SAMPDLY_DLY3_gv            = 0x03,  /* Delay 3 CLK_ADC cycles */
    ADC_SAMPDLY_DLY4_gv            = 0x04,  /* Delay 4 CLK_ADC cycles */
    ADC_SAMPDLY_DLY5_gv            = 0x05,  /* Delay 5 CLK_ADC cycles */
    ADC_SAMPDLY_DLY6_gv            = 0x06,  /* Delay 6 CLK_ADC cycles */
    ADC_SAMPDLY_DLY7_gv            = 0x07,  /* Delay 7 CLK_ADC cycles */
    ADC_SAMPDLY_DLY8_gv            = 0x08,  /* Delay 8 CLK_ADC cycles */
    ADC_SAMPDLY_DLY9_gv            = 0x09,  /* Delay 9 CLK_ADC cycles */
    ADC_SAMPDLY_DLY10_gv           = 0x0A,  /* Delay 10 CLK_ADC cycles */
    ADC_SAMPDLY_DLY11_gv           = 0x0B,  /* Delay 11 CLK_ADC cycles */
    ADC_SAMPDLY_DLY12_gv           = 0x0C,  /* Delay 12 CLK_ADC cycles */
    ADC_SAMPDLY_DLY13_gv           = 0x0D,  /* Delay 13 CLK_ADC cycles */
    ADC_SAMPDLY_DLY14_gv           = 0x0E,  /* Delay 14 CLK_ADC cycles */
    ADC_SAMPDLY_DLY15_gv           = 0x0F   /* Delay 15 CLK_ADC cycles */
} ADC_SAMPDLY_values_t;

/* Sampling Delay Selection bit group configurations*/
typedef enum ADC_SAMPDLY_enum
{
    ADC_SAMPDLY_DLY0_gc            = (ADC_SAMPDLY_DLY0_gv << ADC_SAMPDLY_gp),  /* Delay 0 CLK_ADC cycles */
    ADC_SAMPDLY_DLY1_gc            = (ADC_SAMPDLY_DLY1_gv << ADC_SAMPDLY_gp),  /* Delay 1 CLK_ADC cycles */
    ADC_SAMPDLY_DLY2_gc            = (ADC_SAMPDLY_DLY2_gv << ADC_SAMPDLY_gp),  /* Delay 2 CLK_ADC cycles */
    ADC_SAMPDLY_DLY3_gc            = (ADC_SAMPDLY_DLY3_gv << ADC_SAMPDLY_gp),  /* Delay 3 CLK_ADC cycles */
    ADC_SAMPDLY_DLY4_gc            = (ADC_SAMPDLY_DLY4_gv << ADC_SAMPDLY_gp),  /* Delay 4 CLK_ADC cycles */
    ADC_SAMPDLY_DLY5_gc            = (ADC_SAMPDLY_DLY5_gv << ADC_SAMPDLY_gp),  /* Delay 5 CLK_ADC cycles */
    ADC_SAMPDLY_DLY6_gc            = (ADC_SAMPDLY_DLY6_gv << ADC_SAMPDLY_gp),  /* Delay 6 CLK_ADC cycles */
    ADC_SAMPDLY_DLY7_gc            = (ADC_SAMPDLY_DLY7_gv << ADC_SAMPDLY_gp),  /* Delay 7 CLK_ADC cycles */
    ADC_SAMPDLY_DLY8_gc            = (ADC_SAMPDLY_DLY8_gv << ADC_SAMPDLY_gp),  /* Delay 8 CLK_ADC cycles */
    ADC_SAMPDLY_DLY9_gc            = (ADC_SAMPDLY_DLY9_gv << ADC_SAMPDLY_gp),  /* Delay 9 CLK_ADC cycles */
    ADC_SAMPDLY_DLY10_gc           = (ADC_SAMPDLY_DLY10_gv << ADC_SAMPDLY_gp),  /* Delay 10 CLK_ADC cycles */
    ADC_SAMPDLY_DLY11_gc           = (ADC_SAMPDLY_DLY11_gv << ADC_SAMPDLY_gp),  /* Delay 11 CLK_ADC cycles */
    ADC_SAMPDLY_DLY12_gc           = (ADC_SAMPDLY_DLY12_gv << ADC_SAMPDLY_gp),  /* Delay 12 CLK_ADC cycles */
    ADC_SAMPDLY_DLY13_gc           = (ADC_SAMPDLY_DLY13_gv << ADC_SAMPDLY_gp),  /* Delay 13 CLK_ADC cycles */
    ADC_SAMPDLY_DLY14_gc           = (ADC_SAMPDLY_DLY14_gv << ADC_SAMPDLY_gp),  /* Delay 14 CLK_ADC cycles */
    ADC_SAMPDLY_DLY15_gc           = (ADC_SAMPDLY_DLY15_gv << ADC_SAMPDLY_gp)   /* Delay 15 CLK_ADC cycles */
} ADC_SAMPDLY_t;

/* Accumulation Samples select bit group values */
typedef enum ADC_SAMPNUM_VALUES_enum
{
    ADC_SAMPNUM_NONE_gv            = 0x00,  /* No accumulation */
    ADC_SAMPNUM_ACC2_gv            = 0x01,  /* 2 results accumulated */
    ADC_SAMPNUM_ACC4_gv            = 0x02,  /* 4 results accumulated */
    ADC_SAMPNUM_ACC8_gv            = 0x03,  /* 8 results accumulated */
    ADC_SAMPNUM_ACC16_gv           = 0x04,  /* 16 results accumulated */
    ADC_SAMPNUM_ACC32_gv           = 0x05,  /* 32 results accumulated */
    ADC_SAMPNUM_ACC64_gv           = 0x06,  /* 64 results accumulated */
    ADC_SAMPNUM_ACC128_gv          = 0x07   /* 128 results accumulated */
} ADC_SAMPNUM_values_t;

/* Accumulation Samples select bit group configurations*/
typedef enum ADC_SAMPNUM_enum
{
    ADC_SAMPNUM_NONE_gc            = (ADC_SAMPNUM_NONE_gv << ADC_SAMPNUM_gp),  /* No accumulation */
    ADC_SAMPNUM_ACC2_gc            = (ADC_SAMPNUM_ACC2_gv << ADC_SAMPNUM_gp),  /* 2 results accumulated */
    ADC_SAMPNUM_ACC4_gc            = (ADC_SAMPNUM_ACC4_gv << ADC_SAMPNUM_gp),  /* 4 results accumulated */
    ADC_SAMPNUM_ACC8_gc            = (ADC_SAMPNUM_ACC8_gv << ADC_SAMPNUM_gp),  /* 8 results accumulated */
    ADC_SAMPNUM_ACC16_gc           = (ADC_SAMPNUM_ACC16_gv << ADC_SAMPNUM_gp),  /* 16 results accumulated */
    ADC_SAMPNUM_ACC32_gc           = (ADC_SAMPNUM_ACC32_gv << ADC_SAMPNUM_gp),  /* 32 results accumulated */
    ADC_SAMPNUM_ACC64_gc           = (ADC_SAMPNUM_ACC64_gv << ADC_SAMPNUM_gp),  /* 64 results accumulated */
    ADC_SAMPNUM_ACC128_gc          = (ADC_SAMPNUM_ACC128_gv << ADC_SAMPNUM_gp)   /* 128 results accumulated */
} ADC_SAMPNUM_t;

/* Window Comparator Mode select bit group values */
typedef enum ADC_WINCM_VALUES_enum
{
    ADC_WINCM_NONE_gv              = 0x00,  /* No Window Comparison */
    ADC_WINCM_BELOW_gv             = 0x01,  /* Below Window */
    ADC_WINCM_ABOVE_gv             = 0x02,  /* Above Window */
    ADC_WINCM_INSIDE_gv            = 0x03,  /* Inside Window */
    ADC_WINCM_OUTSIDE_gv           = 0x04   /* Outside Window */
} ADC_WINCM_values_t;

/* Window Comparator Mode select bit group configurations*/
typedef enum ADC_WINCM_enum
{
    ADC_WINCM_NONE_gc              = (ADC_WINCM_NONE_gv << ADC_WINCM_gp),  /* No Window Comparison */
    ADC_WINCM_BELOW_gc             = (ADC_WINCM_BELOW_gv << ADC_WINCM_gp),  /* Below Window */
    ADC_WINCM_ABOVE_gc             = (ADC_WINCM_ABOVE_gv << ADC_WINCM_gp),  /* Above Window */
    ADC_WINCM_INSIDE_gc            = (ADC_WINCM_INSIDE_gv << ADC_WINCM_gp),  /* Inside Window */
    ADC_WINCM_OUTSIDE_gc           = (ADC_WINCM_OUTSIDE_gv << ADC_WINCM_gp)   /* Outside Window */
} ADC_WINCM_t;

